// Задача 3 Проверка числа на четность
int a = 4;
int b = -3;
int c = 7;
if (a % 2 == 0) 
{
    Console.Write ("Четное число = ");
    Console.WriteLine (a);
}
else
{
    Console.Write ("Нечетное число = ");
    Console.WriteLine (a);
}
if (b % 2 == 0) 
{
    Console.Write ("Четное число = ");
    Console.WriteLine (b);
}
else
{
    Console.Write ("Нечетное число = ");
    Console.WriteLine (b);
}
if (c % 2 == 0) 
{
    Console.Write ("Четное число = ");
    Console.WriteLine (c);
}
else
{
    Console.Write ("Нечетное число = ");
    Console.WriteLine (c);
}